DataProcessors/ОчисткаУстаревшихФайловИзКаталогаХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОчисткаУстаревшихФайловИзКаталогаХранения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходныеОрдера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписанияНаМагазинах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ОчисткаУстаревшихФайловИзКаталогаХранения/Ext/ManagerModule.bsl
//+++АК LATV 2018.11.29 ИП-00020489
Функция КодДляВыполненияВПериодическихЗаданиях(ТекущаяОбработка, Параметры) Экспорт

	// Выполнение отчета
	ВыполняемаяОбработка = Обработки.ОчисткаУстаревшихФайловИзКаталогаХранения.Создать();
	
	Параметры.Свойство("Период",				ВыполняемаяОбработка.Период);
	Параметры.Свойство("СписанияНаМагазинах",	ВыполняемаяОбработка.СписанияНаМагазинах);
	
	ВыполняемаяОбработка.ОчиститьУстаревшиеФайлы();

КонецФункции
